Repository: AliloSCOP/sugoi-demo
Catalog: public/lang/texts_*.po
Languages: fr

source: or
fr: ou

source: Default user credentials are :
fr: Les droits utilisateurs par défaut sont :

source: Login
fr: Connexion

source: Everything is allright !
fr: Tout est correct

source: Oops, something went wrong !
fr: aïe, quelque chose s'est mal passé

source: Sugoï demo site
fr: Site de démonstration Sugoï

source: Home
fr: Accueil

source: Users
fr: Utilisateurs

source: Translation
fr: Traductions

source: Database
fr: Base de données

source: You're currently logged as a super <strong>::user::</strong><em> test message</em>
fr: Vous êtes actuellement connectés en tant que <strong>::user::</strong> <em>test message</em>

source: create the first default user.
fr: créer un premier utilisateur par défaut

source: Database administration and migration
fr: Administration et migration base de données

source: The access is limited to admin users.
fr: l'accès est limité aux admins

source: Controller actions
fr: Actions du controlleur

source: Debug or Production mode
fr: Mode Debug ou Production

source: Help
fr: Aide

source: Here you can import a large amount of members in your database from a simple Excel or Libre Office file.<br/><ul><li>The first step is to <a href="/adherents.xls">download this demo file.</a></li><li>Fill out the table, of modify your existing file to striclty match the columns order.</li><li>Once your file is completed, click on "save as" in your spreadsheet software, and select "CSV" format</li><li>Select the following options : separator : <b>coma</b>, encoding : <b>Unicode UTF-8</b></li><li>Save the file</li><li>finally, click on "select a file" on this page and upload it.</li></ul>
fr: Vous pouvez depuis ici importer une grande quantité de membres dans votre base de données depuis un simple Excel ou fichier Libre Office.<br/> <ul><li>La première étape est de <a href="/adherents.xls">télécharger ce fichier d'exemple.</a></li> </ul>

source: This section shows that it's possible to handle plugins in sugoi. Be carefull, the implementation of plugins may change, it's still a work in progress
fr: Cette section montre qu'il est possible de gérer des plugins depuis Sugoi. Attention, les implémentations des plugins peut changer, il s'agit d'un travail en cours de développement

source: As in popular CMS, the core application send events which are catch by the plugins.
fr: Comme dans d'autre CMS populaires, l'application principale envoie des évennements qui sont ensuite capturés par les plugins

source: In this project, a DemoPlugin has been instanciated in order to show you how a plugin is made.
fr: Dans ce projet, un plugin de démonstration a été installé de façon à montrer comment un plugin est fabriqué.

source: The DemoPlugin is listening to "Nav" events.<br/>You can create any type of event in Common.hx depending on you application logic.<br/>The plugins will be able to catch these events to execute some additionnal code or modify the content of the event.
fr: Le plugin DemoPlugin écoute l'évènement "Nav".<br/>Vous pouvez créer tout type d'évennement dans Common.hx selon les besoins de votre application.<br/>

source: For instance, in this navigation bar, the second link has been added by the plugin. This link will lead to the plugin main controller.
fr: Par exemple, dans cette barre de navigation, le second lien a été ajouté par le plugin. Ce lien redirige vers le controlleur principal du plugin.

source: Manage text translation with GetText
fr: Gestion des traductions avec GetText

source: The current app language is
fr: Le langage de l'application est

source: Switch to English
fr: Changer vers le Français

source: Switch to French
fr: Changer vers l'Anglais

source: Edit
fr: Editer

source: Delete
fr: Supprimer

source: Insert
fr: Insérer

source: Here is an example of what you can do with form management.
fr: Voici un exemple de ce que vous pouvez faire avec la gestion des formulaires.
