Repository: AliloSCOP/sugoi-demo
Catalog: lang/texts_*.po
Languages: fr

source: Everything is allright !
fr: Tout va bien !

source: Oops, something went wrong !
fr: Houlà, quelque chose s'est mal passé

source: Sugoï demo site
fr: Site démo Sugoï

source: Home
fr: Accueil

source: Users
fr: Utilisateurs

source: Translation
fr: Traduction

source: Database
fr: Base de données

source: You're currently logged as <strong>::user::</strong>
fr: Vous êtes actuellement connecté en tant que <strong>::user::</strong>

source: Login
fr: Connexion

source: or
fr: ou

source: create the first default user.
fr: Créé le premier utilisateur par défaut.

source: Default user credentials are :
fr: Les identifiants de l'utilisateur par défaut sont :

source: Database administration and migration
fr: Administration et migration de base de données

source: The access is limited to admin users.
fr: L'accès est limité aux administrateurs

source: Controller actions
fr: Actions de controlleurs

source: Debug or Production mode
fr: Mode Production ou Debug

source: Manage text translation with GetText
fr: Gérez la traduction du texte avec Gettext

source: Switch to English
fr: Passer en anglais

source: Switch to French
fr: Passer en français

source: Edit
fr: Modifier

source: Delete
fr: Supprimer

source: Insert
fr: Insérer

source: Here is an example of what you can do with form management.
fr: Voici un exemple de ce qu'on peut faire avec la gestion de formulaire.
